{
    "experiences": [
        {
            "title": "Advanced Building Thermal Dynamics Estimation",
            "subtitle": "Volunteered",
            "workType": "Research Collaboration",
            "workDescription": [
                "Synergy of PINNs and NeuralODEs: Investigating the fusion of Physics-Informed Neural Networks (PINNs) and Neural Ordinary Differential Equations (NeuralODEs) to precisely estimate building thermal dynamics, combining physical laws with continuous-time modeling for accurate results.",
                "Aggregated Modeling of Multi-Zone Buildings: Proposing a novel approach to model multi-zone commercial buildings as aggregated single-zone systems using Artificial Neural Networks (ANNs), simplifying complexity while maintaining accuracy for efficient temperature control and energy efficiency improvements.",
                "Automated Regression and ANN Training: Introducing an automated Python script for data processing and regression modeling, facilitating the training of various ANN architectures like MLPs, RNNs, LSTMs, and GRUs. This automation accelerates experimentation to identify the optimal model for accurate building thermal dynamics estimation."
            ],
            "dateText": "Feb 2024 – Present"
        },
        {
            "title": "Reinforcing Security of Medical Data using Blockchain",
            "subtitle": "NMIMS University",
            "workType": "Masters Research Thesis",
            "workDescription": [
                "Data security and privacy are paramount considerations in modern applications, especially with the increasing number of connected devices. The healthcare industry, in particular, suffers significant losses due to inadequate security measures in data sharing and access management.",
                "The research explores the role of blockchain technology in reinforcing security and privacy measures for medical data. By leveraging blockchain's decentralized trust and cryptographic features, the proposed solution aims to enhance patient data permissions and sharing while ensuring compliance with data protection regulations.",
                "The study demonstrates how blockchain, combined with cryptography, can address the challenges of data security and privacy in healthcare. By utilizing technologies like Hyperledger Fabric and encryption algorithms, the research presents a robust framework for securing electronic medical records and facilitating secure data exchange between patients and healthcare providers."
            ],
            "worklinkText": "Check it out on ",
            "workLink": "https://ieeexplore.ieee.org/document/9065830",
            "dateText": "Aug 2018 – Jul 2019"
        }
    ]
}