{
    "experiences": [
        {
            "title": "Software Engineer II",
            "subtitle": "Philips",
            "workType": "Bengaluru, India",
            "workDescription": [
                "Developed patient detection module using Python, OpenCV, CNN, improving diagnostic accuracy.",
                "Led log analytics project with predictive modeling (Random Forest, Python), reducing errors.",
                "Enhanced radiology system features (React, Python, Docker), expanding market reach 20%.",
                "Won Philips Hackathon with innovative feature, boosting sales 15% with AI.",
                "Optimized data pipelines using PySpark, Hadoop, reducing processing time 40%.",
                "Built real-time analytics dashboard (Tableau, Postgres, SQL), enhancing decision-making by 35%.",
                "Developed scalable data architecture on AWS (Lambda, EC2), cutting operational costs.",
                "Implemented recommendation algorithm (Collaborative Filtering, Python), increasing user engagement by 25%."
              ],
            "dateText": "Jul 2021 - Aug 2023"
        },
        {
            "title": "Software Engineer I",
            "subtitle": "Philips",
            "workType": "Bengaluru, India",
            "workDescription": [
                "Improved system performance by 40% using Webpack, Twilio, and React.",
                "Achieved 80% test coverage with Jest, Jasmine, Unittest, Python.",
                "Led deployment of four features, improving product releases efficiency by 30%.",
                "Developed Cardiology dashboards with Angular, Google Maps API, reducing response time by 8 seconds.",
                "Enhanced diagnostic accuracy using Python, OpenCV, CNN algorithms, processing 10,000 scans monthly.",
                "Optimized legacy architecture for healthcare product using Webpack, Docker, Kubernetes.",
                "Reduced technical debt by 30% using PySpark and predictive analytics algorithms."
            ],
            "dateText": "Aug 2019 - Jul 2021"
        },
        {
            "title": "Software Research Intern",
            "subtitle": "Philips",
            "workType": "Bengaluru, India",
            "workDescription": [
                "Developed healthcare applications in Philips Bengaluru's blockchain lab using Hyperledger.",
                "Created open-source smart contract platform with Hyperledger Fabric, Go lang, Docker.",
                "Engineered health record system, consent management using React, Express, MySQL.",
                "Improved system security compliance by 20% using FHIR HL7 and analysis.",
                "Optimized user interactions and transaction data to reduce breaches by 20%.",
                "Enhanced blockchain deployment efficiency with Docker, Hyperledger Fabric, Go lang.",
                "Achieved runner-up at Philips Hackathon for blockchain-based healthcare solution."
            ],
            "dateText": "Aug 2018 – Jul 2019"
        }
    ]
}